#### Terraform Apply Results 🌟
Preview environment has been deployed. You can now test your changes.

<details><summary>Show Actual Apply</summary>

```

[0m[1mmodule.list_files_lambda.data.aws_region.current: Reading...[0m[0m
[0m[1mdata.aws_acm_certificate.issued: Reading...[0m[0m
[0m[1mmodule.list_files_docker_image.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.list_files_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...[0m[0m
[0m[1mmodule.upload_multiple_file_lambda.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.get_file_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...[0m[0m
[0m[1mmodule.list_files_docker_image.data.aws_region.current: Read complete after 0s [id=us-west-1][0m
[0m[1mmodule.list_files_lambda.data.aws_region.current: Read complete after 0s [id=us-west-1][0m
[0m[1mmodule.list_files_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455][0m
[0m[1mmodule.get_file_lambda.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.upload_multiple_file_lambda.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.get_file_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455][0m
[0m[1mmodule.get_file_lambda.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.get_file_lambda.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.get_file_lambda.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mdata.aws_ssm_parameter.lambda_authorizer_lambda_invoke_arn: Reading...[0m[0m
[0m[1mmodule.upload_multiple_file_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...[0m[0m
[0m[1mmodule.get_file_lambda.data.aws_region.current: Read complete after 0s [id=us-west-1][0m
[0m[1mmodule.upload_multiple_file_lambda.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.upload_multiple_file_docker_image.data.aws_region.current: Reading...[0m[0m
[0m[1mdata.aws_ecr_authorization_token.token: Reading...[0m[0m
[0m[1mmodule.upload_multiple_file_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455][0m
[0m[1mmodule.upload_multiple_file_docker_image.data.aws_caller_identity.this: Reading...[0m[0m
[0m[1mmodule.upload_multiple_file_docker_image.data.aws_region.current: Read complete after 0s [id=us-west-1][0m
[0m[1mmodule.list_files_lambda.data.aws_partition.current: Reading...[0m[0m
[0m[1mdata.aws_caller_identity.this: Reading...[0m[0m
[0m[1mmodule.list_files_lambda.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.list_files_lambda.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.get_file_docker_image.data.aws_caller_identity.this: Reading...[0m[0m
[0m[1mmodule.get_file_lambda.data.aws_caller_identity.current: Read complete after 0s [id=070576557102][0m
[0m[1mmodule.list_files_docker_image.data.aws_caller_identity.this: Reading...[0m[0m
[0m[1mmodule.upload_multiple_file_lambda.data.aws_caller_identity.current: Read complete after 0s [id=070576557102][0m
[0m[1mmodule.get_file_docker_image.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.get_file_docker_image.data.aws_region.current: Read complete after 0s [id=us-west-1][0m
[0m[1mdata.aws_route53_zone.awseducate_systems: Reading...[0m[0m
[0m[1mmodule.upload_multiple_file_docker_image.data.aws_caller_identity.this: Read complete after 0s [id=070576557102][0m
[0m[1mmodule.upload_multiple_file_lambda.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.upload_multiple_file_lambda.data.aws_region.current: Read complete after 0s [id=us-west-1][0m
[0m[1mdata.aws_caller_identity.this: Read complete after 0s [id=070576557102][0m
[0m[1mmodule.get_file_lambda.data.aws_iam_policy_document.additional_inline[0]: Reading...[0m[0m
[0m[1mmodule.upload_multiple_file_lambda.data.aws_iam_policy_document.additional_inline[0]: Reading...[0m[0m
[0m[1mmodule.list_files_lambda.data.aws_iam_policy_document.additional_inline[0]: Reading...[0m[0m
[0m[1mmodule.upload_multiple_file_lambda.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1147343897][0m
[0m[1mmodule.list_files_lambda.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2138108200][0m
[0m[1mmodule.get_file_lambda.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1147343897][0m
[0m[1mmodule.list_files_lambda.data.aws_caller_identity.current: Read complete after 0s [id=070576557102][0m
[0m[1mdata.aws_ecr_authorization_token.token: Read complete after 0s [id=us-west-1][0m
[0m[1mmodule.list_files_docker_image.data.aws_caller_identity.this: Read complete after 0s [id=070576557102][0m
[0m[1mmodule.get_file_docker_image.data.aws_caller_identity.this: Read complete after 0s [id=070576557102][0m
[0m[1mdata.aws_route53_zone.awseducate_systems: Read complete after 0s [id=Z07640481V8AX0BY9VGXY][0m
[0m[1mdata.aws_acm_certificate.issued: Read complete after 0s [id=arn:aws:acm:us-west-1:070576557102:certificate/d5718528-3613-4faf-94d0-b6ca9825ff3f][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform planned the following actions, but then encountered a problem:

[1m  # aws_dynamodb_table.file[0m will be created
[0m  [32m+[0m[0m resource "aws_dynamodb_table" "file" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m billing_mode     = "PAY_PER_REQUEST"
      [32m+[0m[0m hash_key         = "file_id"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "file"
      [32m+[0m[0m read_capacity    = (known after apply)
      [32m+[0m[0m stream_arn       = (known after apply)
      [32m+[0m[0m stream_label     = (known after apply)
      [32m+[0m[0m stream_view_type = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Name" = "file"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Name"        = "file"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m write_capacity   = (known after apply)

      [32m+[0m[0m attribute {
          [32m+[0m[0m name = "created_at"
          [32m+[0m[0m type = "S"
        }
      [32m+[0m[0m attribute {
          [32m+[0m[0m name = "file_extension"
          [32m+[0m[0m type = "S"
        }
      [32m+[0m[0m attribute {
          [32m+[0m[0m name = "file_id"
          [32m+[0m[0m type = "S"
        }

      [32m+[0m[0m global_secondary_index {
          [32m+[0m[0m hash_key           = "file_extension"
          [32m+[0m[0m name               = "file_extension-created_at-gsi"
          [32m+[0m[0m non_key_attributes = []
          [32m+[0m[0m projection_type    = "ALL"
          [32m+[0m[0m range_key          = "created_at"
        }
    }

[1m  # aws_route53_record.api_gateway_custom_domain_record[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "api_gateway_custom_domain_record" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "preview-file-service-internal-api-tpet.aws-educate.tw"
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z07640481V8AX0BY9VGXY"

      [32m+[0m[0m alias {
          [32m+[0m[0m evaluate_target_health = false
          [32m+[0m[0m name                   = (known after apply)
          [32m+[0m[0m zone_id                = (known after apply)
        }
    }

[1m  # random_string.this[0m will be created
[0m  [32m+[0m[0m resource "random_string" "this" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 4
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (known after apply)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = false
    }

[1m  # module.api_gateway.aws_apigatewayv2_api.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_api" "this" {
      [32m+[0m[0m api_endpoint                 = (known after apply)
      [32m+[0m[0m api_key_selection_expression = "$request.header.x-api-key"
      [32m+[0m[0m arn                          = (known after apply)
      [32m+[0m[0m description                  = "File service api gateway to lambda container image"
      [32m+[0m[0m disable_execute_api_endpoint = true
      [32m+[0m[0m execution_arn                = (known after apply)
      [32m+[0m[0m fail_on_warnings             = false
      [32m+[0m[0m id                           = (known after apply)
      [32m+[0m[0m name                         = "preview-file_service"
      [32m+[0m[0m protocol_type                = "HTTP"
      [32m+[0m[0m route_selection_expression   = "$request.method $request.path"
      [32m+[0m[0m tags                         = {
          [32m+[0m[0m "Service"               = "file_service"
          [32m+[0m[0m "terraform-aws-modules" = "apigateway-v2"
        }
      [32m+[0m[0m tags_all                     = {
          [32m+[0m[0m "Environment"           = "preview"
          [32m+[0m[0m "Project"               = "AWS Educate TPET"
          [32m+[0m[0m "Service"               = "file_service"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "apigateway-v2"
        }

      [32m+[0m[0m cors_configuration {
          [32m+[0m[0m allow_headers = [
              [32m+[0m[0m "authorization",
              [32m+[0m[0m "content-type",
              [32m+[0m[0m "x-amz-date",
              [32m+[0m[0m "x-amz-security-token",
              [32m+[0m[0m "x-amz-user-agent",
              [32m+[0m[0m "x-api-key",
            ]
          [32m+[0m[0m allow_methods = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m allow_origins = [
              [32m+[0m[0m "*",
            ]
        }
    }

[1m  # module.api_gateway.aws_apigatewayv2_domain_name.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_domain_name" "this" {
      [32m+[0m[0m api_mapping_selection_expression = (known after apply)
      [32m+[0m[0m arn                              = (known after apply)
      [32m+[0m[0m domain_name                      = "preview-file-service-internal-api-tpet.aws-educate.tw"
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m tags                             = {
          [32m+[0m[0m "Service" = "file_service"
        }
      [32m+[0m[0m tags_all                         = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m domain_name_configuration {
          [32m+[0m[0m certificate_arn                        = "arn:aws:acm:us-west-1:070576557102:certificate/d5718528-3613-4faf-94d0-b6ca9825ff3f"
          [32m+[0m[0m endpoint_type                          = "REGIONAL"
          [32m+[0m[0m hosted_zone_id                         = (known after apply)
          [32m+[0m[0m ownership_verification_certificate_arn = (known after apply)
          [32m+[0m[0m security_policy                        = "TLS_1_2"
          [32m+[0m[0m target_domain_name                     = (known after apply)
        }
    }

[1m  # module.api_gateway.aws_apigatewayv2_integration.this["$default"][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_integration" "this" {
      [32m+[0m[0m api_id                                    = (known after apply)
      [32m+[0m[0m connection_type                           = "INTERNET"
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m integration_response_selection_expression = (known after apply)
      [32m+[0m[0m integration_type                          = "AWS_PROXY"
      [32m+[0m[0m integration_uri                           = (known after apply)
      [32m+[0m[0m payload_format_version                    = "1.0"
      [32m+[0m[0m timeout_milliseconds                      = (known after apply)
    }

[1m  # module.api_gateway.aws_apigatewayv2_integration.this["GET /files"][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_integration" "this" {
      [32m+[0m[0m api_id                                    = (known after apply)
      [32m+[0m[0m connection_type                           = "INTERNET"
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m integration_response_selection_expression = (known after apply)
      [32m+[0m[0m integration_type                          = "AWS_PROXY"
      [32m+[0m[0m integration_uri                           = (known after apply)
      [32m+[0m[0m payload_format_version                    = "1.0"
      [32m+[0m[0m timeout_milliseconds                      = 29000
    }

[1m  # module.api_gateway.aws_apigatewayv2_integration.this["GET /files/{file_id}"][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_integration" "this" {
      [32m+[0m[0m api_id                                    = (known after apply)
      [32m+[0m[0m connection_type                           = "INTERNET"
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m integration_response_selection_expression = (known after apply)
      [32m+[0m[0m integration_type                          = "AWS_PROXY"
      [32m+[0m[0m integration_uri                           = (known after apply)
      [32m+[0m[0m payload_format_version                    = "1.0"
      [32m+[0m[0m timeout_milliseconds                      = 29000
    }

[1m  # module.api_gateway.aws_apigatewayv2_integration.this["POST /upload-multiple-file"][0m will be created
[0m  [32m+[0m[0m resource "aws_apigatewayv2_integration" "this" {
      [32m+[0m[0m api_id                                    = (known after apply)
      [32m+[0m[0m connection_type                           = "INTERNET"
      [32m+[0m[0m id                                        = (known after apply)
      [32m+[0m[0m integration_response_selection_expression = (known after apply)
      [32m+[0m[0m integration_type                          = "AWS_PROXY"
      [32m+[0m[0m integration_uri                           = (known after apply)
      [32m+[0m[0m payload_format_version                    = "1.0"
      [32m+[0m[0m timeout_milliseconds                      = 29000
    }

[1m  # module.api_gateway.aws_cloudwatch_log_group.this["this"][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "this" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = "/aws/apigateway/preview-file_service/preview"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 7
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Service" = "file_service"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.get_file_docker_image.aws_ecr_lifecycle_policy.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_lifecycle_policy" "this" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m rules = [
                  [32m+[0m[0m {
                      [32m+[0m[0m action       = {
                          [32m+[0m[0m type = "expire"
                        }
                      [32m+[0m[0m description  = "Keep only the last 10 images"
                      [32m+[0m[0m rulePriority = 1
                      [32m+[0m[0m selection    = {
                          [32m+[0m[0m countNumber = 10
                          [32m+[0m[0m countType   = "imageCountMoreThan"
                          [32m+[0m[0m tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      [32m+[0m[0m registry_id = (known after apply)
      [32m+[0m[0m repository  = (known after apply)
    }

[1m  # module.get_file_docker_image.aws_ecr_repository.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_repository" "this" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m force_delete         = true
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m image_tag_mutability = "MUTABLE"
      [32m+[0m[0m name                 = (known after apply)
      [32m+[0m[0m registry_id          = (known after apply)
      [32m+[0m[0m repository_url       = (known after apply)
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m image_scanning_configuration {
          [32m+[0m[0m scan_on_push = false
        }
    }

[1m  # module.get_file_docker_image.docker_image.this[0m will be created
[0m  [32m+[0m[0m resource "docker_image" "this" {
      [32m+[0m[0m force_remove = false
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m image_id     = (known after apply)
      [32m+[0m[0m keep_locally = false
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m repo_digest  = (known after apply)
      [32m+[0m[0m triggers     = {
          [32m+[0m[0m "dir_sha" = "b11875c581d923b4ec5728bd4f2832f01a36eacf"
        }

      [32m+[0m[0m build {
          [32m+[0m[0m cache_from     = []
          [32m+[0m[0m context        = "./../get_file/"
          [32m+[0m[0m dockerfile     = "Dockerfile"
          [32m+[0m[0m extra_hosts    = []
          [32m+[0m[0m remove         = true
          [32m+[0m[0m security_opt   = []
          [32m+[0m[0m tag            = []
            [90m# (11 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.get_file_docker_image.docker_registry_image.this[0m will be created
[0m  [32m+[0m[0m resource "docker_registry_image" "this" {
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m insecure_skip_verify = false
      [32m+[0m[0m keep_remotely        = true
      [32m+[0m[0m name                 = (known after apply)
      [32m+[0m[0m sha256_digest        = (known after apply)
      [32m+[0m[0m triggers             = {
          [32m+[0m[0m "dir_sha" = "b11875c581d923b4ec5728bd4f2832f01a36eacf"
        }
    }

[1m  # module.get_file_lambda.data.aws_iam_policy_document.logs[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "logs" {
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m json          = (known after apply)
      [32m+[0m[0m minified_json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "logs:CreateLogGroup",
              [32m+[0m[0m "logs:CreateLogStream",
              [32m+[0m[0m "logs:PutLogEvents",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = (known after apply)
        }
    }

[1m  # module.get_file_lambda.aws_cloudwatch_log_group.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "lambda" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = (known after apply)
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 0
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.get_file_lambda.aws_iam_policy.additional_inline[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "additional_inline" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "dynamodb:UpdateItem",
                          [32m+[0m[0m "dynamodb:Scan",
                          [32m+[0m[0m "dynamodb:Query",
                          [32m+[0m[0m "dynamodb:PutItem",
                          [32m+[0m[0m "dynamodb:GetItem",
                          [32m+[0m[0m "dynamodb:DeleteItem",
                          [32m+[0m[0m "dynamodb:BatchWriteItem",
                          [32m+[0m[0m "dynamodb:BatchGetItem",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "arn:aws:dynamodb:us-west-1:070576557102:table/file"
                      [32m+[0m[0m Sid      = "dynamodbcrud"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "s3:PutObject",
                          [32m+[0m[0m "s3:ListMultipartUploadParts",
                          [32m+[0m[0m "s3:ListBucketMultipartUploads",
                          [32m+[0m[0m "s3:ListBucket",
                          [32m+[0m[0m "s3:GetObject",
                          [32m+[0m[0m "s3:GetBucketLocation",
                          [32m+[0m[0m "s3:DeleteObject",
                          [32m+[0m[0m "s3:DeleteBucket",
                          [32m+[0m[0m "s3:CreateBucket",
                          [32m+[0m[0m "s3:AbortMultipartUpload",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = [
                          [32m+[0m[0m "arn:aws:s3:::preview-aws-educate-tpet-storage/*",
                          [32m+[0m[0m "arn:aws:s3:::preview-aws-educate-tpet-storage",
                        ]
                      [32m+[0m[0m Sid      = "s3crud"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.get_file_lambda.aws_iam_policy.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "logs" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = (known after apply)
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.get_file_lambda.aws_iam_role.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "lambda" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = (known after apply)
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.get_file_lambda.aws_iam_role_policy_attachment.additional_inline[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "additional_inline" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.get_file_lambda.aws_iam_role_policy_attachment.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "logs" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.get_file_lambda.aws_lambda_function.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function" "this" {
      [32m+[0m[0m architectures                  = [
          [32m+[0m[0m "x86_64",
        ]
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m code_sha256                    = (known after apply)
      [32m+[0m[0m description                    = "AWS Educate TPET file-service in preview: GET /files/{file_id}"
      [32m+[0m[0m function_name                  = (known after apply)
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m image_uri                      = (known after apply)
      [32m+[0m[0m invoke_arn                     = (known after apply)
      [32m+[0m[0m last_modified                  = (known after apply)
      [32m+[0m[0m memory_size                    = 128
      [32m+[0m[0m package_type                   = "Image"
      [32m+[0m[0m publish                        = true
      [32m+[0m[0m qualified_arn                  = (known after apply)
      [32m+[0m[0m qualified_invoke_arn           = (known after apply)
      [32m+[0m[0m reserved_concurrent_executions = -1
      [32m+[0m[0m role                           = (known after apply)
      [32m+[0m[0m signing_job_arn                = (known after apply)
      [32m+[0m[0m signing_profile_version_arn    = (known after apply)
      [32m+[0m[0m skip_destroy                   = false
      [32m+[0m[0m source_code_hash               = (known after apply)
      [32m+[0m[0m source_code_size               = (known after apply)
      [32m+[0m[0m tags                           = {
          [32m+[0m[0m "Environment"           = "preview"
          [32m+[0m[0m "Service"               = "file_service"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "lambda"
        }
      [32m+[0m[0m tags_all                       = {
          [32m+[0m[0m "Environment"           = "preview"
          [32m+[0m[0m "Project"               = "AWS Educate TPET"
          [32m+[0m[0m "Service"               = "file_service"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "lambda"
        }
      [32m+[0m[0m timeout                        = 30
      [32m+[0m[0m version                        = (known after apply)

      [32m+[0m[0m environment {
          [32m+[0m[0m variables = {
              [32m+[0m[0m "BUCKET_NAME"    = "preview-aws-educate-tpet-storage"
              [32m+[0m[0m "DYNAMODB_TABLE" = "file"
              [32m+[0m[0m "ENVIRONMENT"    = "preview"
              [32m+[0m[0m "SERVICE"        = "file_service"
            }
        }

      [32m+[0m[0m ephemeral_storage {
          [32m+[0m[0m size = 512
        }

      [32m+[0m[0m logging_config {
          [32m+[0m[0m log_format = "Text"
          [32m+[0m[0m log_group  = (known after apply)
        }
    }

[1m  # module.get_file_lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "current_version_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "apigateway.amazonaws.com"
      [32m+[0m[0m qualifier           = (known after apply)
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = (known after apply)
      [32m+[0m[0m statement_id_prefix = "AllowExecutionFromAPIGateway"
    }

[1m  # module.get_file_lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "unqualified_alias_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "apigateway.amazonaws.com"
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = (known after apply)
      [32m+[0m[0m statement_id_prefix = "AllowExecutionFromAPIGateway"
    }

[1m  # module.list_files_docker_image.aws_ecr_lifecycle_policy.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_lifecycle_policy" "this" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m rules = [
                  [32m+[0m[0m {
                      [32m+[0m[0m action       = {
                          [32m+[0m[0m type = "expire"
                        }
                      [32m+[0m[0m description  = "Keep only the last 10 images"
                      [32m+[0m[0m rulePriority = 1
                      [32m+[0m[0m selection    = {
                          [32m+[0m[0m countNumber = 10
                          [32m+[0m[0m countType   = "imageCountMoreThan"
                          [32m+[0m[0m tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      [32m+[0m[0m registry_id = (known after apply)
      [32m+[0m[0m repository  = (known after apply)
    }

[1m  # module.list_files_docker_image.aws_ecr_repository.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_repository" "this" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m force_delete         = true
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m image_tag_mutability = "MUTABLE"
      [32m+[0m[0m name                 = (known after apply)
      [32m+[0m[0m registry_id          = (known after apply)
      [32m+[0m[0m repository_url       = (known after apply)
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m image_scanning_configuration {
          [32m+[0m[0m scan_on_push = false
        }
    }

[1m  # module.list_files_docker_image.docker_image.this[0m will be created
[0m  [32m+[0m[0m resource "docker_image" "this" {
      [32m+[0m[0m force_remove = false
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m image_id     = (known after apply)
      [32m+[0m[0m keep_locally = false
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m repo_digest  = (known after apply)
      [32m+[0m[0m triggers     = {
          [32m+[0m[0m "dir_sha" = "b11875c581d923b4ec5728bd4f2832f01a36eacf"
        }

      [32m+[0m[0m build {
          [32m+[0m[0m cache_from     = []
          [32m+[0m[0m context        = "./../list_files/"
          [32m+[0m[0m dockerfile     = "Dockerfile"
          [32m+[0m[0m extra_hosts    = []
          [32m+[0m[0m remove         = true
          [32m+[0m[0m security_opt   = []
          [32m+[0m[0m tag            = []
            [90m# (11 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.list_files_docker_image.docker_registry_image.this[0m will be created
[0m  [32m+[0m[0m resource "docker_registry_image" "this" {
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m insecure_skip_verify = false
      [32m+[0m[0m keep_remotely        = true
      [32m+[0m[0m name                 = (known after apply)
      [32m+[0m[0m sha256_digest        = (known after apply)
      [32m+[0m[0m triggers             = {
          [32m+[0m[0m "dir_sha" = "b11875c581d923b4ec5728bd4f2832f01a36eacf"
        }
    }

[1m  # module.list_files_lambda.data.aws_iam_policy_document.logs[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "logs" {
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m json          = (known after apply)
      [32m+[0m[0m minified_json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "logs:CreateLogGroup",
              [32m+[0m[0m "logs:CreateLogStream",
              [32m+[0m[0m "logs:PutLogEvents",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = (known after apply)
        }
    }

[1m  # module.list_files_lambda.aws_cloudwatch_log_group.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "lambda" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = (known after apply)
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 0
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.list_files_lambda.aws_iam_policy.additional_inline[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "additional_inline" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "dynamodb:UpdateItem",
                          [32m+[0m[0m "dynamodb:Scan",
                          [32m+[0m[0m "dynamodb:Query",
                          [32m+[0m[0m "dynamodb:PutItem",
                          [32m+[0m[0m "dynamodb:GetItem",
                          [32m+[0m[0m "dynamodb:DeleteItem",
                          [32m+[0m[0m "dynamodb:BatchWriteItem",
                          [32m+[0m[0m "dynamodb:BatchGetItem",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = [
                          [32m+[0m[0m "arn:aws:dynamodb:us-west-1:070576557102:table/file/index/*",
                          [32m+[0m[0m "arn:aws:dynamodb:us-west-1:070576557102:table/file",
                        ]
                      [32m+[0m[0m Sid      = "dynamodbcrud"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "s3:PutObject",
                          [32m+[0m[0m "s3:ListMultipartUploadParts",
                          [32m+[0m[0m "s3:ListBucketMultipartUploads",
                          [32m+[0m[0m "s3:ListBucket",
                          [32m+[0m[0m "s3:GetObject",
                          [32m+[0m[0m "s3:GetBucketLocation",
                          [32m+[0m[0m "s3:DeleteObject",
                          [32m+[0m[0m "s3:DeleteBucket",
                          [32m+[0m[0m "s3:CreateBucket",
                          [32m+[0m[0m "s3:AbortMultipartUpload",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = [
                          [32m+[0m[0m "arn:aws:s3:::preview-aws-educate-tpet-storage/*",
                          [32m+[0m[0m "arn:aws:s3:::preview-aws-educate-tpet-storage",
                        ]
                      [32m+[0m[0m Sid      = "s3crud"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.list_files_lambda.aws_iam_policy.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "logs" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = (known after apply)
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.list_files_lambda.aws_iam_role.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "lambda" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = (known after apply)
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.list_files_lambda.aws_iam_role_policy_attachment.additional_inline[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "additional_inline" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.list_files_lambda.aws_iam_role_policy_attachment.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "logs" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.list_files_lambda.aws_lambda_function.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function" "this" {
      [32m+[0m[0m architectures                  = [
          [32m+[0m[0m "x86_64",
        ]
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m code_sha256                    = (known after apply)
      [32m+[0m[0m description                    = "AWS Educate TPET file-service in preview: GET /files"
      [32m+[0m[0m function_name                  = (known after apply)
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m image_uri                      = (known after apply)
      [32m+[0m[0m invoke_arn                     = (known after apply)
      [32m+[0m[0m last_modified                  = (known after apply)
      [32m+[0m[0m memory_size                    = 128
      [32m+[0m[0m package_type                   = "Image"
      [32m+[0m[0m publish                        = true
      [32m+[0m[0m qualified_arn                  = (known after apply)
      [32m+[0m[0m qualified_invoke_arn           = (known after apply)
      [32m+[0m[0m reserved_concurrent_executions = -1
      [32m+[0m[0m role                           = (known after apply)
      [32m+[0m[0m signing_job_arn                = (known after apply)
      [32m+[0m[0m signing_profile_version_arn    = (known after apply)
      [32m+[0m[0m skip_destroy                   = false
      [32m+[0m[0m source_code_hash               = (known after apply)
      [32m+[0m[0m source_code_size               = (known after apply)
      [32m+[0m[0m tags                           = {
          [32m+[0m[0m "Environment"           = "preview"
          [32m+[0m[0m "Service"               = "file_service"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "lambda"
        }
      [32m+[0m[0m tags_all                       = {
          [32m+[0m[0m "Environment"           = "preview"
          [32m+[0m[0m "Project"               = "AWS Educate TPET"
          [32m+[0m[0m "Service"               = "file_service"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "lambda"
        }
      [32m+[0m[0m timeout                        = 30
      [32m+[0m[0m version                        = (known after apply)

      [32m+[0m[0m environment {
          [32m+[0m[0m variables = {
              [32m+[0m[0m "BUCKET_NAME"    = "preview-aws-educate-tpet-storage"
              [32m+[0m[0m "DYNAMODB_TABLE" = "file"
              [32m+[0m[0m "ENVIRONMENT"    = "preview"
              [32m+[0m[0m "SERVICE"        = "file_service"
            }
        }

      [32m+[0m[0m ephemeral_storage {
          [32m+[0m[0m size = 512
        }

      [32m+[0m[0m logging_config {
          [32m+[0m[0m log_format = "Text"
          [32m+[0m[0m log_group  = (known after apply)
        }
    }

[1m  # module.list_files_lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "current_version_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "apigateway.amazonaws.com"
      [32m+[0m[0m qualifier           = (known after apply)
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = (known after apply)
      [32m+[0m[0m statement_id_prefix = "AllowExecutionFromAPIGateway"
    }

[1m  # module.list_files_lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "unqualified_alias_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "apigateway.amazonaws.com"
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = (known after apply)
      [32m+[0m[0m statement_id_prefix = "AllowExecutionFromAPIGateway"
    }

[1m  # module.upload_multiple_file_docker_image.aws_ecr_lifecycle_policy.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_lifecycle_policy" "this" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m rules = [
                  [32m+[0m[0m {
                      [32m+[0m[0m action       = {
                          [32m+[0m[0m type = "expire"
                        }
                      [32m+[0m[0m description  = "Keep only the last 10 images"
                      [32m+[0m[0m rulePriority = 1
                      [32m+[0m[0m selection    = {
                          [32m+[0m[0m countNumber = 10
                          [32m+[0m[0m countType   = "imageCountMoreThan"
                          [32m+[0m[0m tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      [32m+[0m[0m registry_id = (known after apply)
      [32m+[0m[0m repository  = (known after apply)
    }

[1m  # module.upload_multiple_file_docker_image.aws_ecr_repository.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_repository" "this" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m force_delete         = true
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m image_tag_mutability = "MUTABLE"
      [32m+[0m[0m name                 = (known after apply)
      [32m+[0m[0m registry_id          = (known after apply)
      [32m+[0m[0m repository_url       = (known after apply)
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m image_scanning_configuration {
          [32m+[0m[0m scan_on_push = false
        }
    }

[1m  # module.upload_multiple_file_docker_image.docker_image.this[0m will be created
[0m  [32m+[0m[0m resource "docker_image" "this" {
      [32m+[0m[0m force_remove = false
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m image_id     = (known after apply)
      [32m+[0m[0m keep_locally = false
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m repo_digest  = (known after apply)
      [32m+[0m[0m triggers     = {
          [32m+[0m[0m "dir_sha" = "b11875c581d923b4ec5728bd4f2832f01a36eacf"
        }

      [32m+[0m[0m build {
          [32m+[0m[0m cache_from     = []
          [32m+[0m[0m context        = "./../upload_multiple_file/"
          [32m+[0m[0m dockerfile     = "Dockerfile"
          [32m+[0m[0m extra_hosts    = []
          [32m+[0m[0m remove         = true
          [32m+[0m[0m security_opt   = []
          [32m+[0m[0m tag            = []
            [90m# (11 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.upload_multiple_file_docker_image.docker_registry_image.this[0m will be created
[0m  [32m+[0m[0m resource "docker_registry_image" "this" {
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m insecure_skip_verify = false
      [32m+[0m[0m keep_remotely        = true
      [32m+[0m[0m name                 = (known after apply)
      [32m+[0m[0m sha256_digest        = (known after apply)
      [32m+[0m[0m triggers             = {
          [32m+[0m[0m "dir_sha" = "b11875c581d923b4ec5728bd4f2832f01a36eacf"
        }
    }

[1m  # module.upload_multiple_file_lambda.data.aws_iam_policy_document.logs[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "logs" {
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m json          = (known after apply)
      [32m+[0m[0m minified_json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "logs:CreateLogGroup",
              [32m+[0m[0m "logs:CreateLogStream",
              [32m+[0m[0m "logs:PutLogEvents",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = (known after apply)
        }
    }

[1m  # module.upload_multiple_file_lambda.aws_cloudwatch_log_group.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "lambda" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = (known after apply)
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 0
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.upload_multiple_file_lambda.aws_iam_policy.additional_inline[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "additional_inline" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "dynamodb:UpdateItem",
                          [32m+[0m[0m "dynamodb:Scan",
                          [32m+[0m[0m "dynamodb:Query",
                          [32m+[0m[0m "dynamodb:PutItem",
                          [32m+[0m[0m "dynamodb:GetItem",
                          [32m+[0m[0m "dynamodb:DeleteItem",
                          [32m+[0m[0m "dynamodb:BatchWriteItem",
                          [32m+[0m[0m "dynamodb:BatchGetItem",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "arn:aws:dynamodb:us-west-1:070576557102:table/file"
                      [32m+[0m[0m Sid      = "dynamodbcrud"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "s3:PutObject",
                          [32m+[0m[0m "s3:ListMultipartUploadParts",
                          [32m+[0m[0m "s3:ListBucketMultipartUploads",
                          [32m+[0m[0m "s3:ListBucket",
                          [32m+[0m[0m "s3:GetObject",
                          [32m+[0m[0m "s3:GetBucketLocation",
                          [32m+[0m[0m "s3:DeleteObject",
                          [32m+[0m[0m "s3:DeleteBucket",
                          [32m+[0m[0m "s3:CreateBucket",
                          [32m+[0m[0m "s3:AbortMultipartUpload",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = [
                          [32m+[0m[0m "arn:aws:s3:::preview-aws-educate-tpet-storage/*",
                          [32m+[0m[0m "arn:aws:s3:::preview-aws-educate-tpet-storage",
                        ]
                      [32m+[0m[0m Sid      = "s3crud"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.upload_multiple_file_lambda.aws_iam_policy.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "logs" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = (known after apply)
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.upload_multiple_file_lambda.aws_iam_role.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "lambda" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = (known after apply)
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "preview"
          [32m+[0m[0m "Project"     = "AWS Educate TPET"
          [32m+[0m[0m "Service"     = "file_service"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.upload_multiple_file_lambda.aws_iam_role_policy_attachment.additional_inline[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "additional_inline" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.upload_multiple_file_lambda.aws_iam_role_policy_attachment.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "logs" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.upload_multiple_file_lambda.aws_lambda_function.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function" "this" {
      [32m+[0m[0m architectures                  = [
          [32m+[0m[0m "x86_64",
        ]
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m code_sha256                    = (known after apply)
      [32m+[0m[0m description                    = "AWS Educate TPET file-service in preview: POST /upload-multiple-file"
      [32m+[0m[0m function_name                  = (known after apply)
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m image_uri                      = (known after apply)
      [32m+[0m[0m invoke_arn                     = (known after apply)
      [32m+[0m[0m last_modified                  = (known after apply)
      [32m+[0m[0m memory_size                    = 128
      [32m+[0m[0m package_type                   = "Image"
      [32m+[0m[0m publish                        = true
      [32m+[0m[0m qualified_arn                  = (known after apply)
      [32m+[0m[0m qualified_invoke_arn           = (known after apply)
      [32m+[0m[0m reserved_concurrent_executions = -1
      [32m+[0m[0m role                           = (known after apply)
      [32m+[0m[0m signing_job_arn                = (known after apply)
      [32m+[0m[0m signing_profile_version_arn    = (known after apply)
      [32m+[0m[0m skip_destroy                   = false
      [32m+[0m[0m source_code_hash               = (known after apply)
      [32m+[0m[0m source_code_size               = (known after apply)
      [32m+[0m[0m tags                           = {
          [32m+[0m[0m "Environment"           = "preview"
          [32m+[0m[0m "Service"               = "file_service"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "lambda"
        }
      [32m+[0m[0m tags_all                       = {
          [32m+[0m[0m "Environment"           = "preview"
          [32m+[0m[0m "Project"               = "AWS Educate TPET"
          [32m+[0m[0m "Service"               = "file_service"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "lambda"
        }
      [32m+[0m[0m timeout                        = 300
      [32m+[0m[0m version                        = (known after apply)

      [32m+[0m[0m environment {
          [32m+[0m[0m variables = {
              [32m+[0m[0m "BUCKET_NAME"    = "preview-aws-educate-tpet-storage"
              [32m+[0m[0m "DYNAMODB_TABLE" = "file"
              [32m+[0m[0m "ENVIRONMENT"    = "preview"
              [32m+[0m[0m "SERVICE"        = "file_service"
            }
        }

      [32m+[0m[0m ephemeral_storage {
          [32m+[0m[0m size = 512
        }

      [32m+[0m[0m logging_config {
          [32m+[0m[0m log_format = "Text"
          [32m+[0m[0m log_group  = (known after apply)
        }
    }

[1m  # module.upload_multiple_file_lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "current_version_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "apigateway.amazonaws.com"
      [32m+[0m[0m qualifier           = (known after apply)
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = (known after apply)
      [32m+[0m[0m statement_id_prefix = "AllowExecutionFromAPIGateway"
    }

[1m  # module.upload_multiple_file_lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "unqualified_alias_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "apigateway.amazonaws.com"
      [32m+[0m[0m source_arn          = (known after apply)
      [32m+[0m[0m statement_id        = (known after apply)
      [32m+[0m[0m statement_id_prefix = "AllowExecutionFromAPIGateway"
    }

[1mPlan:[0m 49 to add, 0 to change, 0 to destroy.
[0m
```

</details>

*Pushed by: @sh1un, Action: `pull_request`*